
const weatherIconConfig = {
    '晴': ['晴'],
    '多云': ['多云', '多云转阴'],
    '多云转晴': ['多云转晴', '晴转多云'],
    '阴': ['阴'],
    '冰雹': ['小密度冰丸', '小阵冰雹', '雹', '大冰雹', '雪丸或小冰雹，夹雨', '降冰雹夹雨', '小或中雷暴，有冰雹', '雪霾', '中或大雪雨夹雪或雹', '强雷暴雹', '降冰雹夹雪', '雪丸或小冰雹，伴有雨夹雪', '小冰雹', '降冰雹，伴有雨夹雪', '降冰雹，伴有雨夹雪', '冰丸', '雪丸或小冰雹', '降冰雹', '小雪雨夹雪雹', '大阵冰雹', '大密度冰丸', '雪丸或小冰雹，夹雪', '中等密度冰丸，密度中等', '阵雹', '冰粒'],
    '雾': ['雾淞', '雾', '蒸汽雾（海，湖或河流）', '北极或南极海面烟雾', '雾或冰雾', '在积冰或积雪上的雾', '海雾', '蒸汽雾（陆地）', '烟雾', '薄雾', '山谷雾'
    ], '雷暴': ['大雷暴', '大雷暴，有阵雨和 / 或阵雨', '小或中雷暴', '海上阵性降水或雷暴', '山上阵性降水或雷暴', '雷暴雹', '雷暴', '强雷暴', '闪电', '远处闪电', '大雷暴，有冰雹', '小中雷暴'],
    '雪': ['雪', '降雪', '中阵雪或间歇性雪', '湿雪', '中大阵雨夹雪', '中雨夹雪', '大阵雪或间歇性雪', '阵雪', '大暴雪', '雨加雪', '米雪', '小雨夹雪', '小阵雪或间歇性雪', '雨夹雪', '特大暴雪', '毛毛雨或米雪', '小阵雨夹雪', '晴空降雪', '暴雪', '小到中雪', '大雪', '中大阵雪', '小雪', '中雪'], '霾': ['火山灰', '尘雾', '扬沙', '霾', '浮尘', '尘或沙沉降', '钻石尘', '远处有尘墙或沙墙（象哈布尘）'],
    '雨': ['降雨', '小阵雪', '冻雨', '毛毛雨夹雪', '冻毛毛雨或冻雨', '中冻雨', '毛毛雨', '小阵雨', '中雨', '大阵雨', '小雨', '大到暴雨', '中阵雨', '特大暴雨', '小阵雨或间歇性雨', '小冻雨', '大雨', '大阵雨或间歇性雨', '大冻雨', '中大雨', '大暴雨', '小到中等冻雨', '冻毛毛雨', '雨', '阵雨', '强降水', '小到中雨', '中阵雨或间歇性雨', '强阵雨或间歇性雨', '阵性或间歇性降水', '降水', '暴雨'],
    '能见度低': ['低或高吹雪或吹沙，能见度ㄒ1公里', '厚尘霾，能见度小于1公里', '重度霾、烟或尘，能见度＜1公里', '超强浓雾，能见度30—60米', '强浓雾，能见度60—90米', '低或高吹雪或沙，能见度 < 1km', '超强浓雾，能见度小于30米', '霾、烟或尘，能见度ㄒ1公里'], '扬尘': ['高吹雪', '低吹尘（吹沙）', '低或高吹雪或吹沙', '高吹飞沫', '大低吹雪', '低吹雪'],
    '沉降': ['火山灰沉降', '湿雪沉降', '尘或沙沉降', '冰壳沉降', '霜淞沉降', '露沉降', '白霜沉降', '雨淞沉降', '雾淞沉降'],
    '龙卷风': ['龙卷风', '漏斗云', '龙卷'],
    '沙尘暴': ['沙尘暴', '强沙尘暴'],
    '飑': ['飑'],
    '乳白天空': ['乳白天空'],
    '未知': ['缺测值', '缺测', '无重要天气', '无观测']
};

const weatherConfig = {
    getWeatherPngByType: function (type) {
        for (let name in weatherIconConfig) {
            for (let k = 0; k < weatherIconConfig[name].length; k++) {
                if (weatherIconConfig[name][k] === type) return name + '.png';
            }
        }
        return '未知.png';
    }
};

export default weatherConfig;